
// სავარჯიშო 1
// შეცვალეთ კოდი მითითებულ ადგილას ისე, რომ console.log(myEmail)-მა ბაუზერის კონსოლში გამოიტანოს Paata.feradze@gmail.com
let myName='Paata.'
let mySurname='feradze'
let mailend='@gmail.com'

// შეცვალეთ კოდი კომენტარის ქვევით 
let myEmail=myName+mySurname+mailend
// შეცვალეთ კოდი კომენტარის ზევით 

console.log(myEmail)





// სავარჯიშო 2 
// შეცვალეთ/ჩაანაცვლეთ X და Y ისე, რომ მიიღოთ შედეგი: "საზამთრო ზაფხულში მწიფდება"

let food="საზამთრო"
let season="ზაფხულ"

// შეცვალეთ კოდი კომენტარის ქვევით 
let sentence=food + " " + season + "ში" + " " + "მწიფდება" 
// შეცვალეთ კოდი კომენტარის ზევით 

console.log(sentence) // ბრაუზერში უნდა გამოიტანოს "საზამთრო ზაფხულში მწიფდება"






// სავარჯიშო 3
// შეცვალეთ მხოლოდ + ოპერატორი სხვა მათემატიკური ოპერატორით
let x=47;
let y=7;
// შეცვალეთ კოდი კომენტარის ქვევით 
let z= x % y
// შეცვალეთ კოდი კომენტარის ზევით 

console.log(z) // ბრაუზერში უნდა გამოიტანოს 5





// სავარჯიშო 4
// გაასწორეთ კოდში დაშვებული შეცდომები, არ დაამატოთ ან ამოაკლოთ რომელიმე ხაზი. საბოლოოდ ბრაუზერში უნდა გამოჰქონდეს 0
// შეცვალეთ კოდი კომენტარის ქვევით 
let MyFirstNumber=20;
let mysecondnumber=10;
let sum;
sum = MyFirstNumber % mysecondnumber
console.log(sum)
// შეცვალეთ კოდი კომენტარის ზევით







// სავარჯიშო 5 
// for ლუპის საშუალებით კონსოლში გამოიტანეთ სტრინგი „Hello World” 10 - ჯერ;
// ქვევით მოცემულ კოდში არის ორი შეცდომა, რომლებიც უნდა გამოასწოროთ.

let text = "Hello World";
for(let i = 0; i < 10; i++) {
console.log(text);
}





// სავარჯიშო 6
// მოცემული ფორმულის მიხედვით კონსოლში დაბეჭდეთ წინადადება: „Hi Jhon” 5-ჯერ; ფორმულა არ არის სრულყოფილი, დაამატეთ პარამეტრები.
let name = "Jhon";
for (let i = 0; i < 5; i++) {
    console.log(`Hi ${name}`)
}






// სავარჯიშო 7.
// დაწერეთ რა პასუხს დააბრუნებს მოცემული პირობები (true-ს თუ false-ს):


/* 1. (3>2 && 2<1) || (4<=3 || 7>4) || (5<=1 && 8<=9); */

console.log(true)

/* 2. (17 != 16 && 18 <= 21) && (21 != “21” || 4 != “4”); */
 
console.log(false)

/* 3.     “str” == “string” && (66 >= 44 || 5 === “5”); */

console.log(false)